{
  "updatedAt": 1686966751,
  "events": [{"Start":"6/16/2023 13:45","End":"6/16/2023 14:45","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"Toonami Generation: 26 Years of Stay Gold","Description":"Twenty-six years ago Moltar of Cartoon Network's Cartoon Planet sent a satellite to bring back the very best in action animation. Today that mission is still going strong with Toonami, the number one place for anime on TV. Join your old friend and host Tom as we celebrate 26 years of the greatest show ever made on Toonami."},{"Start":"6/16/2023 15:00","End":"6/16/2023 16:00","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"It's Toku Time! The American Perspective","Description":"We dive into the weird world of American Tokusatsu, which consists of live action actors fighting, stock footage to save budget, and loads of attempts to convince your parents to buy every single toy there is. We will show our classic WTF Toku shorts to dive into the even stranger decisions that were made during that show's time. Questioning to ourselves: \"How did this even get in here?\""},{"Start":"6/16/2023 16:15","End":"6/16/2023 17:15","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"Do You Sumo? Hakkeyoi!","Description":"Have you ever heard of Sumo Wrestling? Maybe you want to know more about it? Well look no further as this panel will be an introduction to Sumo Wrestling from its religious beginnings to modern day sport. You'll learn about this monumental phenomenon and leave a Rikishi fan. Shobu-ari!"},{"Start":"6/16/2023 17:30","End":"6/16/2023 18:30","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"Sailor Moon: Incarnations of a Beloved Series","Description":"Whether you started with the reboot or have been a fan since the 90's, everyone knows Sailor Moon. But have you seen the musicals? Played the tabletop RPG? Read the light novels? Laughed at the live-action series? Come for the nostalgia as we look at some of the official incarnations of this beloved franchise you might have missed, and stay for the giveaways.  "},{"Start":"6/16/2023 18:45","End":"6/16/2023 19:45","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"Sports Anime: For Love of the Game","Description":"From the conventional to the questionable, Ro and Frost will be discussing sports anime of every variety. You won't want to miss re-living the highs and lows of high school (and sometimes college) sports anime!"},{"Start":"6/16/2023 20:00","End":"6/16/2023 21:30","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"SenpaiNYC Presents: Caesars Challenge","Description":"Audience members will be invited to play a round of unscrambling letters to form words in this classic 1990's Game Show with an anime twist to it!"},{"Start":"6/16/2023 21:45","End":"6/16/2023 23:15","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"SenpaiNYC Presents: Whammy!","Description":"We're playing a classic but with a twist! All the zaniness of Press Your Luck but in a faster paced game! Audience members will get a chance to play the game."},{"Start":"6/16/2023 13:00","End":"6/16/2023 14:30","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Bullets and Butterfly Wings","Description":"Like Magical Girls? Love Idols? Or are you a fan of things with a mecha lean? Welcome to Symphogear!  Come join us as we talk about the series, the meanings behind the songs and delve into the amazing storyline that spanned a decade!"},{"Start":"6/16/2023 14:45","End":"6/16/2023 15:45","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"3D Printing for Cosplay: Beginner to Advanced","Description":"3D printing is helping to make detailed and complex cosplays more accessible than ever before! Join professional 3D artists and cosplayer Keah for an informative panel full of step-by-step guides, helpful resources, advanced tips, and tricks as well as beginner basics for this creative and fun new technology."},{"Start":"6/16/2023 16:00","End":"6/16/2023 17:00","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Mamoru Hosoda: Personal Works of Art","Description":"For many years Mamoru Hosoda has delivered beautifully animated masterpieces such as “The Girl Who Leapt Before Time,” “Summer Wars,” “Wolf Children,” and the recently released “Belle.” But did you know that each of his movies is related to a personal event in his life? Or that he once tried to direct “Howl's Moving Castle?” Time waits for no one. Presented By Virtual Panel Theater."},{"Start":"6/16/2023 17:15","End":"6/16/2023 18:15","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Advising an Anime Club: Getting Cross-Curricular","Description":"Do you still struggle with finding ways to make your anime club \"funducational\" while staying in line with state mandated educational standards? Do you find it challenging to start a discussion about anime without going off on a fan-crazed tangent and embarrassing yourself in front of your students? We will look at some school appropriate titles, create a curriculum that promotes interdisciplinary teaching and fun, and explore the best ways to moderate guided discussion sessions. Professional development certificates will be given to all attendees!"},{"Start":"6/16/2023 18:30","End":"6/16/2023 19:30","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Anime Accessibility in America","Description":"In today's world the ability to watch anime can come at the click of a button. But once upon a time it wasn't that easy in America. From the specialty shops of the 80's to Blockbuster and special television programming blocks of the 90's. From fansubs to the early days of anime streaming of the 2000s. And the continued growth of the industry in the 2010s and beyond. Join host Thomas Matis as he takes you through the evolution of watching anime in America."},{"Start":"6/16/2023 19:45","End":"6/16/2023 20:45","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"The Art of the Eyecatch","Description":"Eyecatches: the little illustrations or animations that interrupt your favorite anime when it cuts away to commercials. Evan Minto (Azuki, Ani-Gamers, Otaku USA, Anime News Network) traces the history of the humble eyecatch and showcases his favorite examples of this under-appreciated art form."},{"Start":"6/16/2023 21:00","End":"6/16/2023 22:00","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Most Likely To: My Hero Academia","Description":"Vote for which My Hero Academia character you think would be “Most likely to ______.” Support your favorite characters and make connections with other fans. Get a chance to explain your reasoning and see if you might be able to sway opinions!"},{"Start":"6/16/2023 22:15","End":"6/16/2023 23:15","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming, 18+","Name":"Harems = Harm 18+","Description":"This is a semi-serious and semi-comedic examination of harem anime series protagonists, the sources of tension in their relationships, and how those might impact their physical and mental well being. Clips of many physical gags will be shown as well as double entendres. Presented by Solidus Panelus."},{"Start":"6/16/2023 17:30","End":"6/16/2023 18:30","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Designing Original Characters: Giving OCs A Makeover!","Description":"Every artist has created an original character at one point or another. This panel will dive into the fundamentals of character design and offer participants an opportunity to redesign their own characters. Topics include drawing a variety of body types and composing eye-catching outfits that will make your characters pop. Participants are encouraged to bring their own drawing supplies, however, pencils and paper will be provided to anyone who needs them."},{"Start":"6/16/2023 18:45","End":"6/16/2023 19:45","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Furoshiki Workshop: The Art of Japanese Fabric Folding","Description":"Have you ever watched an anime character unwrap a Bento box and thought, “That's an awesome way to wrap a lunch! How do I do that?”? Furoshiki is the traditional Japanese art of wrapping everyday parcels for carrying, and this workshop will teach you many common techniques for wrapping and tying such packages."},{"Start":"6/16/2023 20:00","End":"6/16/2023 21:30","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Death Flag or Plot Armor: A Survival Guide for Anime","Description":"A comedic, over-the-top look at where anime characters go wrong and why. Our panelists go over a list of survival tips that every anime character must follow to gain plot armor and avoid that nasty death flag. Presented by Solidus Panelus."},{"Start":"6/16/2023 21:45","End":"6/16/2023 23:15","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming, 18+","Name":"Fanfiction Writing: Grammar Tips, Bio Help, and Free Write 18+","Description":"Learn grammar and formatting tips as well as how to write attention grabbing and engaging bios that make readers want to jump into your story. There will also be time for free writing plus a group brainstorming session! *Lead panelist has a MFA in Creative Writing and a MA in Publishing with a focus in Editing."},{"Start":"6/16/2023 13:00","End":"6/16/2023 14:00","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Panel Programming","Name":"Living in a Material World! Fabric Types of Cosplay","Description":"Looking for the right fabric for your cosplays? Sapphirecatgirl is here to give a crash course on fabric types, where they can be found, and how to best utilize them. Fabric samples will be available for attendees to view as well as a resource list to make finding all types of fabric easier."},{"Start":"6/16/2023 14:30","End":"6/16/2023 16:00","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Game Shows","Name":"Name That Tune!","Description":"Do you have entire Anime and videogame soundstracks memorized? Can you identify \"Moonlight Densetsu\" two bars in? If so you need to come on down to Name that tune, where obsessing over music can make you famous! or at least earn some nice prizes. "},{"Start":"6/16/2023 16:00","End":"6/16/2023 17:30","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Game Shows","Name":"Jeopardy!","Description":"You'd best bring your best buzzer finger and top off your red bull, because we have had 3 years to make the categories this year, and we are bringing it all to you in the great trivia style of Jeopardy!. Randomly chosen audience members will have a chance at fame and fortune! Or at least some manga. Who will have more points than the audience this year? lets find out together, becasue this is Jeopardy!"},{"Start":"6/16/2023 18:00","End":"6/16/2023 19:30","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Game Shows","Name":"Iron Cosplay","Description":"You've heard of Iron Chef, get ready for IRON COSPLAY. (Yes the only proper way to write it is with all caps.) Are you a wizard with a glue gun? Do you work fast and make your cosplay the night before a con, maybe even in the HOTEL room? Can you make anything with duct tape and cardboard? This is a new event Game Shows is hosting where we will have 2 teams of 5 people (one is the model wearing the outfit) competing in front of an audience to create cosplays in under an hour using a pile of scraps, cardboard, duct tape, and a glue gun. Like Iron chef, a few surprises will be sprung on the participants as the work on their creations. Crazy? Maybe. Fun? Definitly. We have a few surprises planned to mix things up and include extra audience participation too, so be prepared for anything!"},{"Start":"6/16/2023 20:00","End":"6/16/2023 21:30","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Panel Programming","Name":"Cloak, Dagger, Kimono, Katana: Spycraft and Other Dirty Deeds","Description":"Thieves, spies, saboteurs, assassins. Whether it's for Queen and Country, or good ol' \"enlightened self-interest\", these animated ne'er-do-wells have the tools, talents and tenacity to get the job done."},{"Start":"6/16/2023 21:45","End":"6/16/2023 23:15","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Panel Programming","Name":"It's Opera, Doc! The Bravado and Bravura of Giant Robo","Description":"Opera brings many concepts to mind: drama, romance, intrigue, hope and sorrow. If you feel the only thing it's missing is \"superpowers\" and \"mecha,” then look no further than \"Giant Robo.” This retro-futuristic gem of the 1990's, based on the collective works of Mitsuteru Yokoyama, the creator of \"Gigantor\" and \"Babel II,” pushed animated storytelling into narrative styles typically reserved for theaters and opera houses."},{"Start":"6/16/2023 13:15","End":"6/16/2023 15:30","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"AMVs","Name":"Friday AMV Non-Finalists","Description":"Every year, we receive far more AMV entries than can fit into our two-hour contest block. The Non-Finalist blocks exist to make sure all of these other fine videos get their chance to shine."},{"Start":"6/16/2023 16:15","End":"6/16/2023 18:15","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"AMVs","Name":"Synced Together: AMVs and Their Editors (Documentary)","Description":"The only full-length documentary film about the art form of anime music videos, covering its past, present, and future... and most importantly, all the lives it has touched along the way.  Five years in the making and including dozens of interviews from around the globe, Synced Together is truly one of a kind, and we're beyond thrilled to finally be able to share it with AnimeNEXT!"},{"Start":"6/16/2023 18:30","End":"6/16/2023 19:30","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"Panel Programming","Name":"Video Game Music Bingo w/ NJ Gamer Symphony Orchestra","Description":"Come test your game music knowledge with the New Jersey Gamer Symphony Orchestra including three rounds of music, prizes, and fun! Grab a bingo card and listen to some great tunes."},{"Start":"6/16/2023 20:00","End":"6/16/2023 22:00","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"AMVs","Name":"AMV Contest Screening","Description":"The only contest where YOU, the audience, get to decide who takes home the coveted AnimeNEXT medals!   You'll see two hours of the best videos we received this year from fans all across the globe, then vote for your favorites.  Ballots will be handed out at the door; you can turn them in on your way out, or at the Info Desk any time before 3 P.M. on Saturday."},{"Start":"6/16/2023 13:00","End":"6/16/2023 16:30","Location":"Main Events - NJCEC Hall D","Type":"","Name":"Rehearsals","Description":"Closed to the public."},{"Start":"6/16/2023 19:30","End":"6/16/2023 21:30","Location":"Main Events - NJCEC Hall D","Type":"","Name":"Rehearsals","Description":"Closed to the public."},{"Start":"6/16/2023 22:30","End":"6/17/2023 1:00","Location":"Main Events - NJCEC Hall D","Type":"18+","Name":"Cosplay Burlesque (18+)","Description":""},{"Start":"6/16/2023 16:45","End":"6/16/2023 17:45","Location":"Guests / Autographs - NJCEC Main Ballroom","Type":"Guests / Autographs","Name":"Blue Encount Q&A","Description":""},{"Start":"6/16/2023 17:30","End":"6/16/2023 18:30","Location":"Guests / Autographs - NJCEC Main Ballroom","Type":"Guests / Autographs","Name":"Blue Encount Autographing","Description":""},{"Start":"6/17/2023 10:00","End":"6/17/2023 11:00","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"Digimon Is Not A Ripoff! The Crazy Story of the Franchise","Description":"Are you a Digimon fan? Were you bullied because people said you liked a ripoff? Well, good news! They're wrong and you can use a lot of info from this panel to prove them wrong!"},{"Start":"6/17/2023 11:15","End":"6/17/2023 12:15","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"Intro to Anime Dolls","Description":"Are you a collector of anime goods? Perhaps you are looking for something more? Well look no further. Anime Dolls might be exactly what you're looking for. This panel will explain everything you need to know such as brands, where to buy, community, and much more"},{"Start":"6/17/2023 12:30","End":"6/17/2023 13:30","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"Your Social Life IS My Business","Description":"We list a number of tips for how workaholics can also have a social life through a comedic look at slice of life anime involving adults and their day jobs. We look at how industries work within their worlds, the way characters all interact, and the big differences between how these anime work vs. high school anime. Presented by Solidus Panelus."},{"Start":"6/17/2023 13:45","End":"6/17/2023 14:45","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming ","Name":"Bakusquad American Sign Language","Description":"Katsuki Bakugo is losing his hearing! Join the Bakusquad to learn the basics of ASL . Bonus content: Learn how to sign Bakugo's nicknames for Class 1A! Presented by a professional interpreter and teacher of the deaf."},{"Start":"6/17/2023 15:00","End":"6/17/2023 16:00","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming ","Name":"Weird and Obscure My Little Pony Fan Content","Description":"My Little Pony: Friendship is Magic was a phenomenon, and though the series is over, a lot of fan content is still being produced. We will showcase the strange ones we've found. From fan series to games and blogs, this panel has it all. This panel is designed to highlight and appreciate all of the content, not to make fun of it. Featuring famous animator DeadlyComics."},{"Start":"6/17/2023 16:15","End":"6/17/2023 17:15","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming ","Name":"Convention Stories","Description":"Whether it was your first convention or your 100th, we're sure you have a story to tell! Like, who pulled the fire alarm?! How did that hole in the wall happen? Come relax and tell us your tales!"},{"Start":"6/17/2023 17:30","End":"6/17/2023 19:00","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming ","Name":"Press Your Luck","Description":"Get ready! It's time for the game show with many Whammies and lots of “Big Bucks!”  Three players will answer questions to earn spins on our big board, which is loaded with goodies, prizes and cash to spend in our prize coffers. But be careful! There are also Whammies that would love to take everything away! Only the player with the most bucks at the end of the game gets to keep it all and maybe come back next year and do it again!"},{"Start":"6/17/2023 19:15","End":"6/17/2023 20:15","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming ","Name":"Mental Health & Bullying At Cons","Description":"Mental health has become an important topic for so many, yet the stigma still exists. Bullying can also be linked to a person's mental health. We will discuss how we can better take care of our mental health as well as bullying and how to combat it."},{"Start":"6/17/2023 20:30","End":"6/17/2023 21:30","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming ","Name":"Azuki Manga Industry Panel","Description":"Join the staff of manga publisher and subscription service Azuki (azuki.co) to learn more about our manga series and our apps on iOS, Android, and Web, and be the first to hear about new license announcements. We’ll have prizes to give out too!"},{"Start":"6/17/2023 21:45","End":"6/17/2023 22:45","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming ","Name":"Taboo Tattoos: Japan's Inked History","Description":"Tattoos have been a heated topic of debate in Japan for centuries. While more widely accepted today, the industry in Japan is still riddled with a rich and deep history of a country divided on the permanent art. You will learn various aspects such as the history of Japan's inking, several motifs and designs in Japanese traditional tattoos as well as the state of the industry today. You'll also get a firsthand account of the tattooing process and tips for those looking to explore the art."},{"Start":"6/17/2023 10:30","End":"6/17/2023 11:30","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Gyuaru Culture: The Gal-ificiation of Japanese Feminism","Description":"Japanese subcultures are known for standing out, yet one can spot a gyaru a mile away thanks to their bold style and personalities! A thriving subculture full of laughs, loves, and led by pioneers of female Japanese empowerment, gals welcome one and all into their wild world!"},{"Start":"6/17/2023 11:45","End":"6/17/2023 13:15","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Danganronpa: Mock Class Trials!","Description":"Seven people will be selected to play one of three mock class trials inspired by the video game series Danganronpa! Each round players will try to figure out who is the Blackened (killer) in the group with clues and a brief description of the crime scene. But, there's more! Surprise mini games like hangman and dance battles will be thrown into the mix."},{"Start":"6/17/2023 14:15","End":"6/17/2023 15:15","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming ","Name":"You Call That A Mystery?!","Description":"An examination of the recently resurgent mystery genre in anime. We will look at several recent titles, pull out their core mysteries, and examine both good and bad examples of what makes those mysteries both entertaining and engaging. And if they're solvable by observant viewers. Presented by Solidus Panelus."},{"Start":"6/17/2023 15:30","End":"6/17/2023 16:30","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming ","Name":"A Tale of Two Ghibli Classics","Description":"In 1988 two animated features from Studio Ghibli premiered in Japanese theaters: The lighthearted “My Neighbor Totoro” and the melancholy tragedy “Grave Of The Fireflies,” directed by Hayao Miyazaki and Isao Takahata, respectively. Despite disappointing box office returns both became anime classics and are among many top ten lists of fans today. In celebration of the 35th anniversaries of both films take a trip down memory lane as this panel discusses this odd couple of masterpieces and explores their rich histories. Presented By Virtual Panel Theater."},{"Start":"6/17/2023 16:45","End":"6/17/2023 17:45","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Records of Anime: Collecting Vinyl","Description":"The hottest way to listen to anime music is on records? Come and learn why you should be listening to anime music on vinyl, how to start collecting, where to find it and upcoming releases. You might even get a chance to win an anime vinyl!"},{"Start":"6/17/2023 18:00","End":"6/17/2023 19:00","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Anime Reboots: Understanding Brotherhood Effect","Description":"Updated animation, new dubs, re-translations, and more breathe new life into the anime of yesteryear. But what about the originals? Are they still worth watching in this age of endless reboots? Join Ro and Frost as we take a deep dive into the rising trend of anime reboots, or what we like to call \"The Brotherhood Effect.\""},{"Start":"6/17/2023 19:15","End":"6/17/2023 20:15","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Anime Girls Behaving Badly","Description":"Whether they're body slamming goats or getting down to \"Hellshake Yano,” anime girls who do wild and wacky stunts or crack inappropriate jokes have become a staple of the \"clip show\" genre. But when did this trend start? Learn how it all began as we look back on our favorite anime \"bad\" girls and how they've memed their way into our hearts and popular culture."},{"Start":"6/17/2023 20:30","End":"6/17/2023 21:30","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"SenpaiNYC Presents: Tenable","Description":"We're playing the newest game show hit from the UK! Players are trying to beat our Top 10 Pyramids in Tenable. The goal in each round is to give as many answers as possible out of 10 in a factual list that fits a particular category, such as 10 anime series set in schools."},{"Start":"6/17/2023 22:15","End":"6/18/2023 0:15","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Bad Anime, Bad!","Description":"The pain! Oh dear God, the pain!! How could you ever allow these shows to see the light of day?! Do you think sanity is overrated? Do you want utter oblivion to be your best friend? Strap yourselves in for the worst of the worst the animation industry has to offer! We take no responsibility for any psychological damage or spontaneous combustion during the panel. You have been warned!!"},{"Start":"6/17/2023 10:00","End":"6/17/2023 11:00","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Stage On! Intro to Cosplay Contests 101","Description":"Join abbyonthemoon to learn the basics of entering and participating in cosplay contests and masquerades!"},{"Start":"6/17/2023 11:15","End":"6/17/2023 12:45","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Foam Armor and Prop-Making","Description":"Ever wondered how to make foam armor and props for cosplay? This panel will teach you about the basics of EVA Foam and how to assemble your pieces! Presented By @iziebuilds."},{"Start":"6/17/2023 13:00","End":"6/17/2023 14:30","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Con Survival: How to Make the Most Out of the Con","Description":"Going to conventions can be fun yet stressful. We will discuss what to do before going, during and after a con to make the most out of your time at the event and have the best experience possible. This includes managing your money, time, and even health."},{"Start":"6/17/2023 14:45","End":"6/17/2023 15:45","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Introduction to Yokai","Description":"Have you ever experienced a supernatural phenomenon that can't be explained? Have you ever wondered what that hyper-specific reference was in your manga or game? Well you're in luck! Join SpookySurgeon and AceDefective as we tell you about some cool and powerful yokai, and where you may have encountered them in the media before!"},{"Start":"6/17/2023 16:00","End":"6/17/2023 17:30","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Swansongs and Bullets","Description":"Not all magical girls are sugary sweet. Sometimes the war has casualties. And sometimes when you win, you lose. Join us as we descend into the darker side of the magical girl genre."},{"Start":"6/17/2023 17:45","End":"6/17/2023 19:15","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Dynamic Improv: Anime Edition","Description":"Son Goku, Usagi Tsukino, and Izuku Midoriya walk into a bar. How does that play out? In Dynamic Improv: Anime Edition that's what the audience needs to figure out.We will have a hat with scenes that pairs of two will pick from. Tickets will be handed out at the door for random pair selection. Best part? There will be prizes for those who participate! All rules will be explained at the beginning of the panel."},{"Start":"6/17/2023 19:30","End":"6/17/2023 20:30","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Pepakura: The Art of Papercraft","Description":"Papercraft, or Pepakura, is the art of turning a 3D model, often from a video game, into a real world paper model. Papercraft is a fun and inexpensive way to build and collect your favorite characters, and has been adapted as a way to make cosplay armor and props as well. Join WhiteRakogis of Rakogis Papercraft as he shows you the process of creating a paper model, from design to building it."},{"Start":"6/17/2023 20:45","End":"6/17/2023 21:45","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"How To Get Your Friends Into Anime","Description":"What if you had the ability to turn the normies in your life into true otakus and weebs? Backed by real life success stories and examples from the professional sales world, this panel will arm you with the skills, system, and confidence to navigate one of life's most perplexing and complicated questions: “How can I get the friends in my life into anime?”"},{"Start":"6/17/2023 22:00","End":"6/17/2023 23:30","Location":"Panels 3 - Hyatt Conference I","Type":"Panel Programming","Name":"Split Second","Description":"In this fast paced game show a three part question is shown to all players. Players score points for correct answers. At the end of the game the winner goes on to try and win a nice grand prize."},{"Start":"6/17/2023 11:30","End":"6/17/2023 12:30","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Game Shows, Guests / Autographs","Name":"Match Game","Description":"Watch as our fabulous guests match wits with you and the\nrest of the audience in this exciting game of Mad-Libs based on the hit television show, with an otaku twist!  This game is so full of _______ you'll be sorry if you miss it!"},{"Start":"6/17/2023 14:00","End":"6/17/2023 15:30","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Game Shows","Name":"Cosplay Dating Game","Description":"Think you'd only see the pairing of your dreams in crossover fanfic?  Come check out the Dating Game!  Our lovely bachelorettes and handsome bachelors from various anime, manga and video games are out for love and wacky hijinks the likes of which you've never seen!"},{"Start":"6/17/2023 16:00","End":"6/17/2023 17:00","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Panel Programming","Name":"Name that Nerd Tune","Description":"Are you a music lover? Do you know the names of all the songs in Steven Universe? Do you buy the OST from video games just because you love it so much? Then this panel is for you! Come test your musical knowledge in categories like K-Pop, J-Pop, anime, western cartoons, musicals, online culture/memes, and video games. Prizes will be given to all participants."},{"Start":"6/17/2023 17:15","End":"6/17/2023 18:15","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Panel Programming","Name":"Vtubers: Down the Virtual Rabbit Hole","Description":"The age of the internet has given rise to many things, including the vtuber. From Hololive to Kawa to indies, we'll be discussing the origins of vtubing and how it came to be so popular today as well as how you too can become a vtuber."},{"Start":"6/17/2023 18:30","End":"6/17/2023 19:15","Location":"Game Shows / Panels - Hyatt Regency D","Type":"Panel Programming","Name":"2023 Manga Debut Recommendations","Description":"Looking for some new manga to read? You've come to the right place! Join Joe Pascullo (New York Public Library, School Library Journal) to learn about some of the news series debuting in English this year in the US. There's a manga out there for everyone, and hopefully you discover some you didn't know about at this panel!"},{"Start":"6/17/2023 22:00","End":"6/17/2023 23:30","Location":"Game Shows / Panels - Hyatt Regency D","Type":"18+","Name":"Baggage: 18+ Cosplay Dating Game","Description":"Everyone has some embarrassing, gross, unique, or weird about themselves, This goes double for our favorite Anime, Manga and video game characters. In Baggage, an eligible single character will have 3 characters to choose from, but each of them have 3 secrets to reveal about themselves that could make or break the relationship before it begins! Will we have a happy couple or will the final piece of baggage be the drill that broke the robots back? You'll have to come out to find out for sure!"},{"Start":"6/17/2023 10:00","End":"6/17/2023 12:00","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"Panel Programming","Name":"Would You Rather: Anime Edition","Description":"Which Pokémon would you rather have as your starter: Torchic or Starmie? Which city would you rather be forced to live in for the rest of your days: Racoon City or Silent Hill? Could you tell us why? Excellent! Join our panel as we explore the more silly side of Would You Rather: Anime Edition, have plenty of goofy moments, and you may even win a badge to AnimeNEXT 2024!"},{"Start":"6/17/2023 12:00","End":"6/17/2023 12:30","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"Event Preparation","Name":"Contest Setup","Description":"Closed to the public."},{"Start":"6/17/2023 12:30","End":"6/17/2023 14:30","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"AMVs","Name":"AMV Contest Screening","Description":"The only contest where YOU, the audience, get to decide who takes home the coveted AnimeNEXT medals!   You'll see two hours of the best videos we received this year from fans all across the globe, then vote for your favorites.  Ballots will be handed out at the door; you can turn them in on your way out, or at the Info Desk any time before 3 P.M. on Saturday."},{"Start":"6/17/2023 14:45","End":"6/17/2023 15:45","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"Panel Programming","Name":"Anime World of Fashion","Description":"Three fashion designers present an anime fashion show, PowerPoint presentation and Q&A."},{"Start":"6/17/2023 16:00","End":"6/17/2023 17:30","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"AMVs","Name":"AnimeNEXT AMVs 20-Year Retrospective","Description":"(Featuring Mike LaBrie from Kanzenshuu!)  Can you believe it's been over 20 years already?  From VHS tapes all the way to today, AnimeNEXT AMV staff past and present combine to dig into our AMV archives, share stories of the good old days, and see just how far we've come."},{"Start":"6/17/2023 17:45","End":"6/17/2023 20:00","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"AMVs","Name":"Saturday AMV Non-Finalists","Description":"Every year, we receive far more AMV entries than can fit into our two-hour contest block. The Non-Finalist blocks exist to make sure all of these other fine videos get their chance to shine."},{"Start":"6/17/2023 21:00","End":"6/17/2023 22:00","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"AMVs","Name":"AMV Contest Awards Show","Description":"The people (that's you!) have spoken! Your ballots have determined the winners and runners-up in each category from the AMV contest, and here's where you'll see the results."},{"Start":"6/17/2023 22:15","End":"6/18/2023 0:15","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"Panel Programming, 18+","Name":"Would You Rather: Anime Edition 18+","Description":"Do you know which Pokemon you'd use to stimulate your partner in bed? Which city you'd streak through for the giggles: Raccoon City or Silent Hill? Could you tell us why?  PERFECT!  Join our panel as we explore the more risque side of Would You Rather: Anime Edition, have plenty of 18+ shenanigans, and possibly win a badge to AnimeNEXT 2024!"},{"Start":"6/17/2023 10:00","End":"6/17/2023 12:00","Location":"Main Events - NJCEC Hall D","Type":"","Name":"Masquerade Rehearsal","Description":""},{"Start":"6/17/2023 16:30","End":"6/17/2023 19:00","Location":"Main Events - NJCEC Hall D","Type":"Main Events","Name":"AnimeNEXT Masquerade","Description":""},{"Start":"6/17/2023 19:30","End":"6/17/2023 20:30","Location":"Main Events - NJCEC Hall D","Type":"","Name":"Blue Encount Sound Check","Description":"Closed to the public."},{"Start":"6/17/2023 21:00","End":"6/17/2023 22:30","Location":"Main Events - NJCEC Hall D","Type":"Main Events","Name":"Blue Encount Concert","Description":""},{"Start":"6/17/2023 23:00","End":"6/18/2023 1:30","Location":"Main Events - NJCEC Hall D","Type":"Main Events","Name":"AnimeNEXT Dance Party","Description":""},{"Start":"6/17/2023 12:00","End":"6/17/2023 13:00","Location":"Guests / Autographs - NJCEC Main Ballroom","Type":"Guests / Autographs","Name":"Autographs: Jon Allen & Paul Castro","Description":""},{"Start":"6/17/2023 13:15","End":"6/17/2023 14:15","Location":"Guests / Autographs - NJCEC Main Ballroom","Type":"Guests / Autographs","Name":"Autographs: Lex Lang & Sandy Fox","Description":""},{"Start":"6/17/2023 16:00","End":"6/17/2023 17:15","Location":"Guests / Autographs - NJCEC Main Boardroom","Type":"Guests / Autographs","Name":"Autographs: Morgan Berry & Bob Carter","Description":""},{"Start":"6/17/2023 17:15","End":"6/17/2023 18:15","Location":"Guests / Autographs - NJCEC Main Boardroom","Type":"Guests / Autographs","Name":"Autographs: Ray Hurd, Charles Campbell, & Phil Parsons","Description":""},{"Start":"6/18/2023 9:45","End":"6/18/2023 11:15","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"Farkle","Description":"Two contestants face off to answer multiple-choice trivia questions to take control of our six dice screens, where every roll is a gamble! Based on the classic dice games Farkle, Zilch, Greed and Hot Dice."},{"Start":"6/18/2023 11:30","End":"6/18/2023 12:30","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"The Early Works of Hayao Miyazaki","Description":"Hayao Miyazaki and Studio Ghibli have enchanted millions of viewers around the world for more than 40 years with unforgettable masterpieces such as “Spirited Away,” “Princess Mononoke,” and many more. Long before becoming Japanese animation's most beloved director, Miyazaki worked on numerous other projects at various studios across Japan. Learn about ten movies and two television series, some of which were never released in America, which helped build Miyazaki's stardom. It's a compelling chapter in the history of the “Walt Disney of Japan” you won't want to miss.Presented By Virtual Panel Theater."},{"Start":"6/18/2023 12:45","End":"6/18/2023 13:45","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"Ensemble Stars Kahoot Trivia","Description":"An interactive event hinging on attendant participation. While competitive, those attending can still learn in-game lore no matter their level of expertise. The kahoot rounds vary across easy, medium, hard, and expert, and anyone is welcome to take a swing. Winners and other participants may receive small awards such as stickers and/or buttons."},{"Start":"6/18/2023 14:00","End":"6/18/2023 16:00","Location":"Panels 1 - Hyatt Regency E","Type":"Panel Programming","Name":"Older than VHS: Gen-X Recollection of the Early Days of American Anime Fandom","Description":"Without a doubt \"Anime\" has become a part of the mainstream, but have you ever wondered how it all started in America? How did anime-themed fan organizations, publications and conventions somehow thrive back in the Long-Long-Ago of the pre-internet years. We've assembled a crew of old-school fans (re: \"geezers\") to tell their tales of how humble beginnings led to the entertainment behemoth we all enjoy today."},{"Start":"6/18/2023 9:30","End":"6/18/2023 10:30","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Anime Clubs 101","Description":"A guide to help create an anime club in your school or community as well as provide new ideas you can use for an established club."},{"Start":"6/18/2023 10:45","End":"6/18/2023 12:45","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Cant Dance Crew Presents: KPop Dance Workshop!","Description":"Attention Blinks, Midzys, BTS Army, NCTizens, and other KPop fans! Come out and dance to the latest K-Pop choreography with Can't Dance Crew! We'll teach you step-by-step how to dance to one of your favorite K-Pop songs and have fun with a random play dance afterwards. Don't worry if you can't dance because we're all here to have fun! We really hope you will come dance with us!"},{"Start":"6/18/2023 13:00","End":"6/18/2023 14:00","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"Itabags: I'm Cringey and I'm Proud!","Description":"Itabagging has been a part of Japanese fandom for decades now, growing each and every year as love for anime grows. From strange beginnings to extreme ends, it serves as the ultimate love letter to characters and fandoms. Cringe never dies and neither will Itabagging!"},{"Start":"6/18/2023 14:15","End":"6/18/2023 15:15","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"The True & Secret History of Shonen Action!","Description":"Ask people where Shonen action manga originated from and many will say that Dragon Ball was the \"father\" of the genre, or maybe Fist of the North Star. The truth, though, is that there's an entire legacy that came before them. Join The Land of Obscusion for a look at a history so jam packed that Dragon Ball and Fist of the North Star are at the end of the panel!"},{"Start":"6/18/2023 15:30","End":"6/18/2023 16:30","Location":"Panels 2 - Hyatt Regency F","Type":"Panel Programming","Name":"The History of American Anime","Description":"From Walt Disney's “Sleeping Beauty” to DC Comics' “Young Justice,” there has been a long history of American involvement with the anime style. Join your host Thomas Matis as he takes you on a journey of discovery through the history of American anime."},{"Start":"6/18/2023 9:45","End":"6/18/2023 10:45","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"Panel Programming","Name":"Summer Kpop Random Dance party","Description":"Summer is here!! Finally, after the long winter and spring, join us for this refreshing and energetic K-Pop random dance play filled with summer songs! Let's Dance the Night Away! (We hope Onces liked that) What are you waiting for?"},{"Start":"6/18/2023 11:30","End":"6/18/2023 13:30","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"AMVs","Name":"AMV Contest Encore","Description":"The only contest where YOU, the audience, get to decide who takes home the coveted AnimeNEXT medals!   You'll see two hours of the best videos we received this year from fans all across the globe\n(There is no voting at this showing, but extra ballots will be given out if anyone wishes to have one to take home.)"},{"Start":"6/18/2023 13:45","End":"6/18/2023 14:45","Location":"AMVs/Panels - Hyatt Garden State Ballroom","Type":"AMVs","Name":"AMV Sing Along!","Description":"It's an hour of the best sing-along-able AMVs we've ever seen, all with lyrics captioned so you can't go wrong.  Come join us for this annual musical tradition, and let's wrap up AnimeNEXT 2023 on a high note!"},{"Start":"6/18/2023 10:00","End":"6/18/2023 12:30","Location":"Main Events - NJCEC Hall D","Type":"","Name":"Rehearsals","Description":"Closed to the public."},{"Start":"6/18/2023 11:30","End":"6/18/2023 13:30","Location":"NJCEC Hall C","Type":"Game Shows","Name":"Cosplay Chess","Description":"What's better than human-sized chess? Using human cosplayers as the chees pieces! This year's theme is Might vs. Magic!"},{"Start":"6/18/2023 12:00","End":"6/18/2023 13:00","Location":"Guests / Autographs - NJCEC Main Ballroom","Type":"Guests / Autographs","Name":"Autographs: Jon Allen, Paul Castro, Ray Hurd, Phil Parsons, & Charles Campbell","Description":""},{"Start":"6/18/2023 13:15","End":"6/18/2023 14:15","Location":"Guests / Autographs - NJCEC Main Ballroom","Type":"Guests / Autographs","Name":"Autographs: Lex Lang, Sandy Fox, Morgan Berry, & Bob Carter","Description":""},{"Start":"6/18/2023 13:30","End":"6/18/2023 15:00","Location":"Main Events - NJCEC Hall D","Type":"Main Events","Name":"Concert: Dom Palombi's Game Night","Description":""},{"Start":"6/17/2023 13:00","End":"6/17/2023 15:00","Location":"NJCEC Hall C","Type":"Main Events","Name":"Cosplay Pro Wrestling","Description":""},{"Start":"6/17/2023 16:00","End":"6/17/2023 22:00","Location":"Hyatt Regency Ballroom C","Type":"Tournaments","Name":"YGO! Constructed","Description":"Single elimination, grand final @8pm"},{"Start":"6/17/2023 14:00","End":"6/17/2023 22:00","Location":"Hyatt Regency Ballroom C","Type":"Tournaments","Name":"Digimon Constructed","Description":""},{"Start":"6/17/2023 16:00","End":"6/17/2023 22:00","Location":"Hyatt Regency Ballroom C","Type":"Tournaments","Name":"One Piece Constructed","Description":""},{"Start":"6/17/2023 18:00","End":"6/17/2023 22:00","Location":"Hyatt Regency Ballroom C","Type":"Tournaments","Name":"YGO! Grand Final","Description":""},{"Start":"6/18/2023 10:00","End":"6/18/2023 15:00","Location":"Hyatt Regency Ballroom C","Type":"Tournaments","Name":"Pokemon","Description":""},{"Start":"6/18/2023 12:00","End":"6/18/2023 15:00","Location":"Hyatt Regency Ballroom C","Type":"Tournaments","Name":"MTG","Description":""}]
}